Revit 2027 API
BuiltInFailures.ConnectorFailures.InvalidPowerFactorValue Property
 The value for Power Factor must be between 0 and 1.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId InvalidPowerFactorValue { get; }
Public Shared ReadOnly Property InvalidPowerFactorValue As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ InvalidPowerFactorValue {
	FailureDefinitionId^ get ();
}
static member InvalidPowerFactorValue : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ConnectorFailures Class
Autodesk.Revit.DB Namespace